OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/compressible/rhoSimpleFoam/squareBend/system/isentropicTotalPressure
// -*- C++ -*-

isentropicPressure
{
    type            pressure;
    libs            (fieldFunctionObjects);
    enabled         yes;
    writeControl    writeTime;
    mode            isentropic;
    result          isentropicP;
}


// ************************************************************************* //